In [1]:
import pandas as pd

In [2]:
ds = pd.read_csv('warmUp.csv')
ds

     Name  Marks  Gender
0  Sourov     95    Male
1     Joy     94    Male
2    Dana     99  Female
3   Limon     84    Male
4  Humaon     93    Male
5  Shawon     85    Male
6    Lara     92  Female
7  Mehedi     90    Male
8    Raju     89    Male
9  Raihan     82    Male

# Display top 3 rows of the data set

In [4]:
ds.head(3)

     Name  Marks  Gender
0  Sourov     95    Male
1     Joy     94    Male
2    Dana     99  Female

# check last 3 rows of the dataset

In [5]:
ds.tail(3)

     Name  Marks Gender
7  Mehedi     90   Male
8    Raju     89   Male
9  Raihan     82   Male

# find shape of our dataset(number of row && columns)

In [49]:
ds.shape

(10, 4)

In [13]:
print("Number of Rows: ",ds.shape[0])
print("Number of Columns: ",ds.shape[1])

Number of Rows:  10
Number of Columns:  3

# Get information about our dataset like total number rows,columns,datatype of each column and memory requirement

In [7]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    10 non-null     object
 1   Marks   10 non-null     int64
 2   Gender  10 non-null     object
dtypes: int64(1), object(2)
memory usage: 368.0+ bytes

# check null value in the dataset

In [11]:
# ds.isnull()
ds.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

# Get overall statistics about the dataframe

In [12]:
# ds.describe()
ds.describe(include='all')

          Name      Marks Gender
count       10  10.000000     10
unique      10        NaN      2
top     Sourov        NaN   Male
freq         1        NaN      8
mean       NaN  90.300000    NaN
std        NaN   5.375872    NaN
min        NaN  82.000000    NaN
25%        NaN  86.000000    NaN
50%        NaN  91.000000    NaN
75%        NaN  93.750000    NaN
max        NaN  99.000000    NaN

# find unique values from the gender column

In [13]:
ds['Gender'].unique()

array(['Male', 'Female'], dtype=object)

# find the number of unique values from the gender column

In [10]:
ds['Gender'].nunique()

2

# display count of unique value in gender column

In [9]:
ds['Gender'].value_counts()

Male      8
Female    2
Name: Gender, dtype: int64

# find total number of student having marks between 90 to 100(inclusive)Using between method

In [8]:
ds[ds['Marks']>=90]

     Name  Marks  Gender
0  Sourov     95    Male
1     Joy     94    Male
2    Dana     99  Female
4  Humaon     93    Male
6    Lara     92  Female
7  Mehedi     90    Male

In [29]:
ds[(ds['Marks']>=90)&(ds['Marks']<=100)]

     Name  Marks  Gender
0  Sourov     95    Male
1     Joy     94    Male
2    Dana     99  Female
4  Humaon     93    Male
6    Lara     92  Female
7  Mehedi     90    Male

In [6]:
len(ds[(ds['Marks']>=90)&(ds['Marks']<=100)])

6

In [33]:
ds[ds['Marks'].between(90,100)]

     Name  Marks  Gender
0  Sourov     95    Male
1     Joy     94    Male
2    Dana     99  Female
4  Humaon     93    Male
6    Lara     92  Female
7  Mehedi     90    Male

In [35]:
sum(ds['Marks'].between(90,100))

6

In [39]:
# find average marks
# ds["Marks"].mean()
# ds["Marks"].min()
ds["Marks"].max()

99

# Apply Method

In [43]:
def marks(x):
    return x//2

In [44]:
ds['Half_marks']=ds['Marks'].apply(marks)

In [45]:
ds

     Name  Marks  Gender  Half_marks
0  Sourov     95    Male          47
1     Joy     94    Male          47
2    Dana     99  Female          49
3   Limon     84    Male          42
4  Humaon     93    Male          46
5  Shawon     85    Male          42
6    Lara     92  Female          46
7  Mehedi     90    Male          45
8    Raju     89    Male          44
9  Raihan     82    Male          41

In [46]:
ds['Marks'].apply(lambda x:x//2)

0    47
1    47
2    49
3    42
4    46
5    42
6    46
7    45
8    44
9    41
Name: Marks, dtype: int64

In [47]:
ds["Name"].apply(len)

0    6
1    3
2    4
3    5
4    6
5    6
6    4
7    6
8    4
9    6
Name: Name, dtype: int64

# MAP Function

In [51]:
ds['Male_Female']=ds['Gender'].map({'Male':1,'Female':0})

In [52]:
ds

     Name  Marks  Gender  Half_marks  Male_Female
0  Sourov     95    Male          47            1
1     Joy     94    Male          47            1
2    Dana     99  Female          49            0
3   Limon     84    Male          42            1
4  Humaon     93    Male          46            1
5  Shawon     85    Male          42            1
6    Lara     92  Female          46            0
7  Mehedi     90    Male          45            1
8    Raju     89    Male          44            1
9  Raihan     82    Male          41            1

# Drop the columns

In [54]:
ds.drop('Male_Female',axis=1)

     Name  Marks  Gender  Half_marks
0  Sourov     95    Male          47
1     Joy     94    Male          47
2    Dana     99  Female          49
3   Limon     84    Male          42
4  Humaon     93    Male          46
5  Shawon     85    Male          42
6    Lara     92  Female          46
7  Mehedi     90    Male          45
8    Raju     89    Male          44
9  Raihan     82    Male          41

In [56]:
ds.drop(['Male_Female','Half_marks'],axis=1,inplace=True)

In [57]:
ds

     Name  Marks  Gender
0  Sourov     95    Male
1     Joy     94    Male
2    Dana     99  Female
3   Limon     84    Male
4  Humaon     93    Male
5  Shawon     85    Male
6    Lara     92  Female
7  Mehedi     90    Male
8    Raju     89    Male
9  Raihan     82    Male

# Print Name of the columns

In [58]:
ds.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [59]:
ds.index

RangeIndex(start=0, stop=10, step=1)

# Sort the datafrem as per the marks column

In [61]:
# ds.sort_values(by='Marks')
ds.sort_values(by='Marks',ascending=False)

     Name  Marks  Gender
2    Dana     99  Female
0  Sourov     95    Male
1     Joy     94    Male
4  Humaon     93    Male
6    Lara     92  Female
7  Mehedi     90    Male
8    Raju     89    Male
5  Shawon     85    Male
3   Limon     84    Male
9  Raihan     82    Male

# Display name & Marks of the Female students

In [63]:
ds[ds['Gender']=='Female'][['Name','Marks']]

   Name  Marks
2  Dana     99
6  Lara     92